src/ChartsOfCharacteristicTypes/ПараметрыОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ПараметрыОбследований</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ПричиныОбращения</v8:Type>
				<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияПараметровОбследований</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>10</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПараметровШаблоновОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритВычисления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривязкаКЗубам</Name>
					<Comment>Данный параметр составной</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодчиненРеквизиту</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/Enums/ТипыПараметровШаблоновОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПараметровШаблоновОбследований</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Статический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Динамический</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ChartsOfCharacteristicTypes/ПараметрыОбследований/Ext/ObjectModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Обработчик заполнения объекта внешними данными
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)	
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Родитель") Тогда
			ЭтотОбъект.Родитель      = ДанныеЗаполнения.Родитель;
			ЭтотОбъект.Специализация = ДанныеЗаполнения.Родитель.Специализация;
		КонецЕсли;		 
		Если ДанныеЗаполнения.Свойство("Специализация") Тогда
			ЭтотОбъект.Специализация = ДанныеЗаполнения.Специализация;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		ЭтотОбъект.ТипЗначения = Новый ОписаниеТипов("Строка");	
		ЭтотОбъект.ТипПараметра = Перечисления.ТипыПараметровШаблоновОбследований.Статический;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик перед записью объекта 
Процедура ПередЗаписью(Отказ)	
	
	#Если НЕ МобильноеПриложениеСервер Тогда	
	Если НЕ Предопределенный
			И ЗначениеЗаполнено(Родитель)
			И Родитель = ПланыВидовХарактеристик.ПараметрыОбследований.Предопределенные Тогда
		
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перенос элементов в группу предопределенных параметров запрещен!");
		
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти
